title: LSASS Dump via Procdump or ProcessAccess (Sysmon)
id: 3d7a9f59-9b3d-4084-9d0a-8b6a0b1b7bcd
status: experimental
description: Detects Procdump/COMSvcs MiniDump targeting LSASS or Sysmon ProcessAccess to LSASS.
author: Khaireddine
date: 2025/08/21
logsource: { product: windows, service: sysmon }
detection:
  sel_proc:
    EventID: 1
    Image|endswith: ['\procdump.exe','\procdump64.exe','\rundll32.exe']
    CommandLine|contains:
      - ' lsass'
      - 'MiniDump'
  sel_pa:
    EventID: 10
    TargetImage|endswith: '\lsass.exe'
  condition: sel_proc or sel_pa
fields: [UtcTime, Image, CommandLine, ParentImage, TargetImage, User]
falsepositives: [Legitimate memory dumps by EDR/backup tools]
level: high
tags: [attack.credential_access, attack.t1003, attack.t1003.001]