title: LSA Secrets Enumeration via Registry/PowerShell
id: 7d0c2e5a-9c1c-40a7-9b7b-6a3b9b9c6f10
status: experimental
description: Detects access to HKLM\SECURITY\Policy\Secrets via reg.exe or PS registry providers.
author: Khaireddine
date: 2025/08/23
logsource: { product: windows, category: process_creation }
detection:
  reg:
    Image|endswith: \reg.exe
    CommandLine|contains|all: [query,'HKLM\SECURITY\Policy\Secrets']
  ps:
    Image|endswith: [\powershell.exe,\pwsh.exe]
    CommandLine|contains: ['HKLM:\\SECURITY\\Policy\\Secrets','Registry::HKEY_LOCAL_MACHINE\\SECURITY\\Policy\\Secrets']
  condition: reg or ps
fields: [CommandLine, ParentImage, User]
falsepositives: [Rare legit audits]
level: high
tags:
  - attack.credential-access
  - attack.t1003.004