title: Windows Credential Dumping via Reg Save or Shadow Copy (SAM/SYSTEM/SECURITY)
id: 3f8a3a8f-1d6a-4f0a-9dfc-1b9d6a34e0b2
status: experimental
description: Detects attempts to dump SAM by saving registry hives or copying from VSS/GlobalRoot paths.
author: Khaireddine
date: 2025/08/23
logsource: { product: windows, category: process_creation }
detection:
  regsave:
    Image|endswith: \reg.exe
    CommandLine|contains|all: [save]
    CommandLine|contains: ['hklm\sam','hklm\system','hklm\security']
  copycfg:
    CommandLine|contains: ['\Windows\System32\config\SAM','\Windows\System32\config\SYSTEM','\Windows\System32\config\SECURITY']
  vss:
    CommandLine|contains: HarddiskVolumeShadowCopy
  condition: regsave or copycfg or vss
fields: [CommandLine, ParentImage, User, IntegrityLevel]
falsepositives: [Backup/IR tooling exporting hives]
level: high
tags:
  - attack.credential-access
  - attack.t1003.002
