title: DCSync / Directory Replication Privilege Abuse
id: 611eab06-a145-4dfa-a295-3ccc5c20f59a
status: test
description: Detects 4662 operations on AD objects with replication rights indicative of DCSync.
author: Khaireddine
date: 2025/08/23
logsource: { product: windows, service: security }
detection:
  sel:
    EventID: 4662
    Properties|contains:
      - Replicating Directory Changes All
      - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
      - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
      - 89e95b76-444d-4c62-991a-0facbeda640c
    AccessMask: '0x100'
  f_winmgr: { SubjectDomainName: 'Window Manager' }
  f_machine: { SubjectUserName|endswith: '$' }
  f_msol: { SubjectUserName|startswith: 'MSOL_' }
  condition: sel and not (f_winmgr or f_machine or f_msol)
fields: [SubjectUserName, ObjectName, Properties]
falsepositives: [Azure AD Connect/legit replication]
level: critical
tags:
  - attack.credential-access
  - attack.t1003.006