title: Run/RunOnce Persistence – Suspicious Value (Sysmon EID 13)
id: e1a3c0b5-c0e9-4c5b-9cd0-bfb2a783b13f
status: experimental
description: Run/RunOnce/Explorer\Run values pointing to suspicious paths, LOLBins, or UNC.
author: Khaireddine
date: 2025/08/23
logsource: { product: windows, category: registry_event }
detection:
  sel_key:
    EventID: 13
    TargetObject|contains:
      - \Software\Microsoft\Windows\CurrentVersion\Run\
      - \Software\Microsoft\Windows\CurrentVersion\RunOnce\
      - \Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run\
      - \Software\WOW6432Node\Microsoft\Windows\CurrentVersion\Run\
      - \Software\WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\
  sel_bad:
    Details|contains:
      - \AppData\
      - \Temp\
      - \Downloads\
      - '\\\\'
      - \powershell.exe
      - \wscript.exe
      - \cscript.exe
      - \cmd.exe
      - \rundll32.exe
      - .ps1
      - .vbs
  fp_common:
    Details|contains:
      - \Microsoft OneDrive\OneDrive.exe
      - \Microsoft\Teams\Update.exe
      - \NVIDIA Corporation\
      - \Google\Update\
  condition: sel_key and sel_bad and not fp_common
fields: [TargetObject, Details, Image]
falsepositives: [Legit updaters/IT agents; baseline first]
level: high
tags:
  - attack.persistence
  - attack.t1547.001
