title: Disable or Weaken Microsoft Defender via CLI
id: 1f2c4d9e-0a8a-4a8b-9b3e-77b9d5e0f6a2
status: experimental
description: Detects attempts to weaken/disable Defender using PowerShell/CMD.
author: Khaireddine
date: 2025/08/23
logsource: { product: windows, category: process_creation }
detection:
  sel_img: { Image|endswith: [\powershell.exe, \pwsh.exe, \cmd.exe] }
  sel_cmd:
    CommandLine|contains: [Set-MpPreference, Add-MpPreference, DisableRealtimeMonitoring, MAPSReporting, SubmitSamplesConsent, DisableIOAVProtection, TurnOffRealTimeMonitoring, DisableBehaviorMonitoring]
  condition: sel_img and sel_cmd
fields: [CommandLine, ParentImage, User]
falsepositives: [Admins configuring Defender]
level: high
tags:
  - attack.defense-evasion
  - attack.t1562.001
