title: Suspicious Scheduled Task Activity
id: f7a9d3b1-6c4e-4f2a-b8e3-9c2d5f7a4b3e
status: stable
description: Detects suspicious creation, modification, or deletion of scheduled tasks using schtasks.exe or PowerShell ScheduledTask cmdlets, considering stealthy flags and high privileges.
author: Khaireddine
date: 2025/09/11
logsource:
  product: windows
  category: process_creation
  service: sysmon
detection:
  selection_schtasks:
    EventID: 1
    Image|endswith: '\schtasks.exe'
    ParentImage|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
  selection_taskrun:
    CommandLine|contains:
      - '/tr'
      - '/TR'
  selection_scheduletype:
    CommandLine|contains:
      - '/sc'
      - '/SC'
  selection_create:
    CommandLine|contains:
      - 'create'
      - 'Create'
  slection_others:
    CommandLine|contains:
      - 'onlogon'
      - 'onstart'
      - '/ru system'
      - 'ONCE'
      - '/ST'
      - '/RU'
      - '/U'
      - '/S'
      - '/F'
      - '/f'
      - '/tn'
      - '/TN'
  selection_powershell:
    EventID: 1
    Image|endswith: '\powershell.exe'
    ParentImage|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
    CommandLine|contains|all:
      - 'New-ScheduledTask'
      - 'Register-ScheduledTask'
      - 'Set-ScheduledTask'
  selection_del:
    CommandLine|contains:
      - '/delete'
      - '/Delete'
  selection_remove:
    EventID: 1
    Image|endswith: '\powershell.exe'
    ParentImage|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
    CommandLine|contains|all:
      - 'Unregister-ScheduledTask'
      - '-TaskName'
      - '-confirm:$false'
  condition: >
    (selection_schtasks
    and selection_taskrun
    and selection_scheduletype
    and selection_create
    and slection_others)
    or selection_powershell
    or (selection_schtasks
    and selection_del
    and slection_others)
    or selection_remove
fields:
  - UtcTime
  - Image
  - CommandLine
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate administrative task creation
  - Enterprise management or installer tools
level: high
tags:
  - attack.persistence
  - attack.t1053
  - attack.t1053.005
