title: Lateral Movement via Admin Shares (ADMIN$ / C$)
id: a2f4b6c0-9b3d-4e9a-8f2a-1e0a4b7c9d22
status: experimental
description: Detects access to ADMIN$ or C$ administrative shares.
author: Khaireddine
date: 2025/08/23
logsource: { product: windows, service: security }
detection:
  sel:
    EventID: 5140
    ShareName|startswith: '\\\\'
    ShareName|contains: ['\ADMIN$','\C$']
  condition: sel
fields: [SubjectUserName, IpAddress, ShareName]
falsepositives: [Routine IT admin/deployment]
level: medium
tags:
  - attack.lateral-movement
  - attack.t1021.002
