title: Suspicious WinRM Activity via PowerShell
id: 8fddc04c-93ab-4b62-9a0f-6b75c1e0b3f5
status: experimental
description: Detects suspicious PowerShell command lines that enable, disable, or use WinRM for remote management, which can be abused for lateral movement.
author: Khaireddine
date: 2025/09/14
logsource:
  product: windows
  category: process_creation
  service: sysmon
detection:
  selection:
    EventID: 1
    Image|endswith: '\powerShell.exe'
    CommandLine|contains_any:
      - 'Enable-PSRemoting'
      - 'Disable-PSRemoting'
      - 'evil-winrm'
  condition: selection
fields:
  - UtcTime
  - Image
  - CommandLine
  - ParentImage
  - ParentCommandLine
  - User
falsepositives:
  - Legitimate system administration enabling/disabling PSRemoting
  - Security testing tools if used in red team / pentest context
level: high
tags:
  - attack.lateral_movement
  - attack.t1021
  - attack.t1021.006
